#Использовать "../src"

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;

	ИменаТестов = Новый Массив;

	ИменаТестов.Добавить("Тест_Версия");
	ИменаТестов.Добавить("Тест_ЗапускБезПараметров");
	ИменаТестов.Добавить("Тест_ЗапускБезПутиКБазе");

	Возврат ИменаТестов;

КонецФункции

Процедура Тест_Версия() Экспорт
	
	Ожидаем.Что(ПараметрыСистемы.Версия(), "Версия не равна 1.0.0").Равно("1.0.0");	

КонецПроцедуры

Процедура Тест_ЗапускБезПараметров() Экспорт
	
	ОбщегоНазначения.КомандаСистемы("oscript ./src/main.os");		

КонецПроцедуры

Процедура Тест_ЗапускБезПутиКБазе() Экспорт
	
	Попытка
		ОбщегоНазначения.КомандаСистемы("oscript ./src/main.os release ");				
	Исключение
		Текст = ИнформацияОбОшибке().Описание;
		Ожидаем.Что(Текст, "Некорректное сообщение об ошибке")
				.Содержит("Не указана строка соединения с базой");
		Возврат;
	КонецПопытки;

	ВызватьИсключение "Запуск формирования релиза без строки соединения не вызвал ошибки";

КонецПроцедуры